Revit 2026 API

# XYZTripleProduct Method

---

The triple product of this vector and the two specified vectors.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TripleProduct(
	XYZ middle,
	XYZ right
)
```
```vb
Public Function TripleProduct (
	middle As XYZ,
	right As XYZ
) As Double
```
```cpp
public:
double TripleProduct(
	XYZ^ middle,
	XYZ^ right
)
```
```fsharp
member TripleProduct :
        middle : XYZ *
        right : XYZ -> float
```

#### Parameters

middle XYZ
    The second vector.
right XYZ
    The third vector.

#### Return Value

DoubleThe real number equal to the triple product.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when middle or right is . |

The scalar triple product is defined as the dot product of one of the vectors with the cross product of the other two. Geometrically, this product is the (signed) volume of the parallelepiped formed by the three vectors given.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace